In [4]:
import pandas as pd
retail = pd.read_csv("./retail/retail_2016_2017.csv")
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [5]:
retail.loc[:,['sales','onpromotion']].sample(100).sum().round(2)

sales          47253.53
onpromotion      813.00
dtype: float64

In [6]:
retail.loc[:,['sales','onpromotion']].sample(100).mean().round(2)

sales          385.98
onpromotion      3.58
dtype: float64

In [7]:
retail.loc[:,['sales','onpromotion']].mean()

sales          457.722487
onpromotion      5.937977
dtype: float64

In [8]:
retail.loc[:,['sales','onpromotion']].std()

sales          1317.154845
onpromotion      18.086321
dtype: float64

### Grouping dataframes

In [9]:
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [11]:
retail.groupby('family')['sales'].sum().head()

family
AUTOMOTIVE       226139.0
BABY CARE          7903.0
BEAUTY           166189.0
BEVERAGES     105700279.0
BOOKS              6438.0
Name: sales, dtype: float64

In [12]:
retail.groupby('family')[['sales']].sum().head() ## double brackets returen dataframe

                  sales
family
AUTOMOTIVE     226139.0
BABY CARE        7903.0
BEAUTY         166189.0
BEVERAGES   105700279.0
BOOKS            6438.0

In [13]:
retail.groupby('family')[['sales']].mean().sort_values('sales', ascending=False)

                                  sales
family
GROCERY I                   4480.338968
BEVERAGES                   3306.440159
PRODUCE                     2299.909514
CLEANING                    1192.684653
DAIRY                        889.104511
BREAD/BAKERY                 534.690257
POULTRY                      387.135622
MEATS                        361.343401
PERSONAL CARE                318.871778
DELI                         300.856381
HOME CARE                    293.847472
EGGS                         189.385729
FROZEN FOODS                 161.930166
PREPARED FOODS               103.479924
LIQUOR,WINE,BEER              94.052271
HOME AND KITCHEN I            30.963338
HOME AND KITCHEN II           27.721784
SEAFOOD                       22.808709
GROCERY II                    22.714120
CELEBRATION                   13.917073
LADIESWEAR                    11.531657
PLAYERS AND ELECTRONICS       10.608515
LAWN AND GARDEN               10.120026
PET SUPPLIES                   7.407752
AUTOMOTIVE                     7.073918
MAGAZINES                      6.351258
LINGERIE                       6.121747
SCHOOL AND OFFICE SUPPLIES     6.068381
BEAUTY                         5.198605
HARDWARE                       1.292668
HOME APPLIANCES                0.423111
BABY CARE                      0.247216
BOOKS                          0.201389

### Exercise 1 top stores by transactions
-- return top 10 stores by total tx in data

In [15]:
transactions = pd.read_csv("./retail/transactions.csv", parse_dates=["date"])
transactions.head()

        date  store_nbr  transactions
0 2013-01-01         25           770
1 2013-01-02          1          2111
2 2013-01-02          2          2358
3 2013-01-02          3          3487
4 2013-01-02          4          1922

In [20]:
transactions.groupby('store_nbr')[['transactions']].sum().sort_values('transactions',ascending=False).iloc[:10]
#retail.groupby('family')[['sales']].mean().sort_values('sales', ascending=False)

           transactions
store_nbr
44              7273093
47              6535810
45              6201115
46              5990113
3               5366350
48              5107785
8               4637971
49              4574103
50              4384444
11              3972488

In [22]:
transactions.groupby(['store_nbr'])['transactions'].sum().sort_values(ascending=False).iloc[:10] # series

store_nbr
44    7273093
47    6535810
45    6201115
46    5990113
3     5366350
48    5107785
8     4637971
49    4574103
50    4384444
11    3972488
Name: transactions, dtype: int64

### multiple columns group by

In [23]:
retail.groupby(['family','store_nbr'])[['sales']].sum()

                             sales
family     store_nbr
AUTOMOTIVE 1           2524.000000
           2           3918.000000
           3           6790.000000
           4           2565.000000
           5           3667.000000
...                            ...
SEAFOOD    50         12773.966999
           51         34250.948976
           52          1219.475999
           53          3745.180001
           54          1082.000000

[1782 rows x 1 columns]

In [24]:
retail.groupby(['family','store_nbr'],
              as_index=False)[['sales']].sum()

          family  store_nbr         sales
0     AUTOMOTIVE          1   2524.000000
1     AUTOMOTIVE          2   3918.000000
2     AUTOMOTIVE          3   6790.000000
3     AUTOMOTIVE          4   2565.000000
4     AUTOMOTIVE          5   3667.000000
...          ...        ...           ...
1777     SEAFOOD         50  12773.966999
1778     SEAFOOD         51  34250.948976
1779     SEAFOOD         52   1219.475999
1780     SEAFOOD         53   3745.180001
1781     SEAFOOD         54   1082.000000

[1782 rows x 3 columns]

In [27]:
retail.groupby(['family','store_nbr'],
              as_index=False)[['sales']].sum().query("family=='SEAFOOD'")

       family  store_nbr         sales
1728  SEAFOOD          1  15898.003002
1729  SEAFOOD          2  21453.224996
1730  SEAFOOD          3  60799.703097
1731  SEAFOOD          4  19222.407985
1732  SEAFOOD          5   6751.715996
1733  SEAFOOD          6  27767.546987
1734  SEAFOOD          7  32790.004997
1735  SEAFOOD          8  30746.884018
1736  SEAFOOD          9  10363.489010
1737  SEAFOOD         10   1865.000000
1738  SEAFOOD         11   6017.000000
1739  SEAFOOD         12   2743.000000
1740  SEAFOOD         13   1517.000000
1741  SEAFOOD         14   3099.000000
1742  SEAFOOD         15   3235.000000
1743  SEAFOOD         16    930.000000
1744  SEAFOOD         17   8133.462000
1745  SEAFOOD         18   5579.008001
1746  SEAFOOD         19   2998.000000
1747  SEAFOOD         20   8251.176989
1748  SEAFOOD         21   3389.000000
1749  SEAFOOD         22   1274.000000
1750  SEAFOOD         23   8249.763009
1751  SEAFOOD         24  19709.906009
1752  SEAFOOD         25   3400.083000
1753  SEAFOOD         26   1882.401000
1754  SEAFOOD         27  13096.517999
1755  SEAFOOD         28   4061.947000
1756  SEAFOOD         29   4093.000000
1757  SEAFOOD         30   2656.000000
1758  SEAFOOD         31   3420.000000
1759  SEAFOOD         32   1151.000000
1760  SEAFOOD         33    907.000000
1761  SEAFOOD         34   2311.000000
1762  SEAFOOD         35    342.000000
1763  SEAFOOD         36    858.000000
1764  SEAFOOD         37  10072.682001
1765  SEAFOOD         38  10552.260009
1766  SEAFOOD         39   7701.136999
1767  SEAFOOD         40   2544.000000
1768  SEAFOOD         41   4524.587999
1769  SEAFOOD         42  11396.924998
1770  SEAFOOD         43    609.000000
1771  SEAFOOD         44  68004.214969
1772  SEAFOOD         45  60529.397995
1773  SEAFOOD         46  32504.479029
1774  SEAFOOD         47  52595.424000
1775  SEAFOOD         48  17550.742004
1776  SEAFOOD         49  56530.157002
1777  SEAFOOD         50  12773.966999
1778  SEAFOOD         51  34250.948976
1779  SEAFOOD         52   1219.475999
1780  SEAFOOD         53   3745.180001
1781  SEAFOOD         54   1082.000000

### Exercise 2 group by multiple columns 
- txn by store and month
- sort table from first month to last month , then by tx from highest to lowest within each month

In [28]:
transactions["month"] = transactions["date"].dt.month

transactions.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [34]:
transactions.groupby(['store_nbr','month'],
                    as_index=False)[['transactions']].sum().sort_values(['month','transactions'],ascending=[True,False])

     store_nbr  month  transactions
516         44      1        628438
552         47      1        568824
528         45      1        538370
540         46      1        522763
24           3      1        463260
..         ...    ...           ...
383         32     12         86167
251         21     12         84128
503         42     12         76741
347         29     12         76627
263         22     12         50650

[641 rows x 3 columns]

In [36]:
(transactions
 .groupby(['store_nbr','month'],)[['transactions']]
 .sum()
 .sort_values(['month','transactions'],ascending=[True,False])
)

                 transactions
store_nbr month
44        1            628438
47        1            568824
45        1            538370
46        1            522763
3         1            463260
...                       ...
32        12            86167
21        12            84128
42        12            76741
29        12            76627
22        12            50650

[641 rows x 1 columns]

### Multi index dataframes

In [38]:
retail.groupby(['family','store_nbr'])[['sales']].sum()

                             sales
family     store_nbr
AUTOMOTIVE 1           2524.000000
           2           3918.000000
           3           6790.000000
           4           2565.000000
           5           3667.000000
...                            ...
SEAFOOD    50         12773.966999
           51         34250.948976
           52          1219.475999
           53          3745.180001
           54          1082.000000

[1782 rows x 1 columns]

In [39]:
retail.groupby(['family','store_nbr'])[['sales']].sum().loc['AUTOMOTIVE'].head()

            sales
store_nbr
1          2524.0
2          3918.0
3          6790.0
4          2565.0
5          3667.0

In [40]:
retail.groupby(['family','store_nbr'])[['sales']].sum().loc["AUTOMOTIVE":"BEAUTY"]

                       sales
family     store_nbr
AUTOMOTIVE 1          2524.0
           2          3918.0
           3          6790.0
           4          2565.0
           5          3667.0
...                      ...
BEAUTY     50         6353.0
           51         3566.0
           52          972.0
           53         3812.0
           54          405.0

[162 rows x 1 columns]

In [49]:
print(retail.groupby(['family', 'store_nbr'])[['sales']].sum().index)

MultiIndex([('AUTOMOTIVE',  1),
            ('AUTOMOTIVE',  2),
            ('AUTOMOTIVE',  3),
            ('AUTOMOTIVE',  4),
            ('AUTOMOTIVE',  5),
            ('AUTOMOTIVE',  6),
            ('AUTOMOTIVE',  7),
            ('AUTOMOTIVE',  8),
            ('AUTOMOTIVE',  9),
            ('AUTOMOTIVE', 10),
            ...
            (   'SEAFOOD', 45),
            (   'SEAFOOD', 46),
            (   'SEAFOOD', 47),
            (   'SEAFOOD', 48),
            (   'SEAFOOD', 49),
            (   'SEAFOOD', 50),
            (   'SEAFOOD', 51),
            (   'SEAFOOD', 52),
            (   'SEAFOOD', 53),
            (   'SEAFOOD', 54)],
           names=['family', 'store_nbr'], length=1782)

In [51]:
# inner layers 
retail.groupby(['family','store_nbr'])[['sales']].sum().loc[('AUTOMOTIVE',24),:]

sales    2234.0
Name: (AUTOMOTIVE, 24), dtype: float64

In [45]:
retail.groupby(['family','store_nbr'])[['sales']].sum().loc[('AUTOMOTIVE','24'):('BEAUTY','24'),:]

                       sales
family     store_nbr
AUTOMOTIVE 24         2234.0
           25         1745.0
           26         2755.0
           27         4085.0
           28         4855.0
...                      ...
BEAUTY     20         3536.0
           21         2741.0
           22          905.0
           23         1220.0
           24         3859.0

[109 rows x 1 columns]

In [52]:
retail.groupby(['family','store_nbr'])[['sales']].sum().loc[('AUTOMOTIVE','24'):('AUTOMOTIVE','27'),:]

                       sales
family     store_nbr
AUTOMOTIVE 24         2234.0
           25         1745.0
           26         2755.0
           27         4085.0

In [54]:
retail.groupby(['family','store_nbr'])[['sales']].sum().iloc[:4] # positional index

                       sales
family     store_nbr
AUTOMOTIVE 1          2524.0
           2          3918.0
           3          6790.0
           4          2565.0

In [55]:
# multilevel column index 
retail.groupby(['family','store_nbr']).agg({"sales":['sum','mean']})

                             sales
                               sum       mean
family     store_nbr
AUTOMOTIVE 1           2524.000000   4.263514
           2           3918.000000   6.618243
           3           6790.000000  11.469595
           4           2565.000000   4.332770
           5           3667.000000   6.194257
...                            ...        ...
SEAFOOD    50         12773.966999  21.577647
           51         34250.948976  57.856333
           52          1219.475999   2.059926
           53          3745.180001   6.326318
           54          1082.000000   1.827703

[1782 rows x 2 columns]

In [56]:
retail.groupby(['family','store_nbr']).agg({"sales":['sum','mean']}).iloc[0,0]

np.float64(2524.0)

In [57]:
retail.groupby(['family','store_nbr']).agg({"sales":['sum','mean']}).iloc[0,1]

np.float64(4.263513513513513)

In [58]:
retail.groupby(['family','store_nbr']).agg({"sales":['sum','mean']}).iloc[0,:]

sales  sum     2524.000000
       mean       4.263514
Name: (AUTOMOTIVE, 1), dtype: float64

In [68]:
retail.groupby(['family','store_nbr']).agg({"sales":['sum','mean']}).loc["SEAFOOD",("sales","sum")]

store_nbr
1     15898.003002
2     21453.224996
3     60799.703097
4     19222.407985
5      6751.715996
6     27767.546987
7     32790.004997
8     30746.884018
9     10363.489010
10     1865.000000
11     6017.000000
12     2743.000000
13     1517.000000
14     3099.000000
15     3235.000000
16      930.000000
17     8133.462000
18     5579.008001
19     2998.000000
20     8251.176989
21     3389.000000
22     1274.000000
23     8249.763009
24    19709.906009
25     3400.083000
26     1882.401000
27    13096.517999
28     4061.947000
29     4093.000000
30     2656.000000
31     3420.000000
32     1151.000000
33      907.000000
34     2311.000000
35      342.000000
36      858.000000
37    10072.682001
38    10552.260009
39     7701.136999
40     2544.000000
41     4524.587999
42    11396.924998
43      609.000000
44    68004.214969
45    60529.397995
46    32504.479029
47    52595.424000
48    17550.742004
49    56530.157002
50    12773.966999
51    34250.948976
52     1219.475999
53     3745.180001
54     1082.000000
Name: (sales, sum), dtype: float64

### modify multi - index DataFrames
- reset the index
- swap the index level 
- drop an index level

In [72]:
agg_sales = retail.groupby(['family','store_nbr']).agg({"sales":['sum','mean']})
agg_sales.head()

                       sales
                         sum       mean
family     store_nbr
AUTOMOTIVE 1          2524.0   4.263514
           2          3918.0   6.618243
           3          6790.0  11.469595
           4          2565.0   4.332770
           5          3667.0   6.194257

In [73]:
agg_sales.droplevel(0,axis=1)

                               sum       mean
family     store_nbr
AUTOMOTIVE 1           2524.000000   4.263514
           2           3918.000000   6.618243
           3           6790.000000  11.469595
           4           2565.000000   4.332770
           5           3667.000000   6.194257
...                            ...        ...
SEAFOOD    50         12773.966999  21.577647
           51         34250.948976  57.856333
           52          1219.475999   2.059926
           53          3745.180001   6.326318
           54          1082.000000   1.827703

[1782 rows x 2 columns]

In [75]:
agg_sales.droplevel(0,axis=1).loc[:,"mean"]

family      store_nbr
AUTOMOTIVE  1             4.263514
            2             6.618243
            3            11.469595
            4             4.332770
            5             6.194257
                           ...
SEAFOOD     50           21.577647
            51           57.856333
            52            2.059926
            53            6.326318
            54            1.827703
Name: mean, Length: 1782, dtype: float64

In [76]:
agg_sales = agg_sales.droplevel(0,axis=1)

In [77]:
agg_sales.swaplevel()

                               sum       mean
store_nbr family
1         AUTOMOTIVE   2524.000000   4.263514
2         AUTOMOTIVE   3918.000000   6.618243
3         AUTOMOTIVE   6790.000000  11.469595
4         AUTOMOTIVE   2565.000000   4.332770
5         AUTOMOTIVE   3667.000000   6.194257
...                            ...        ...
50        SEAFOOD     12773.966999  21.577647
51        SEAFOOD     34250.948976  57.856333
52        SEAFOOD      1219.475999   2.059926
53        SEAFOOD      3745.180001   6.326318
54        SEAFOOD      1082.000000   1.827703

[1782 rows x 2 columns]

In [80]:
agg_sales.swaplevel().loc[1]

                                     sum         mean
family
AUTOMOTIVE                  2.524000e+03     4.263514
BABY CARE                   0.000000e+00     0.000000
BEAUTY                      1.776000e+03     3.000000
BEVERAGES                   1.238601e+06  2092.231419
BOOKS                       2.110000e+02     0.356419
BREAD/BAKERY                2.239978e+05   378.374639
CELEBRATION                 9.072000e+03    15.324324
CLEANING                    3.906000e+05   659.797297
DAIRY                       4.309830e+05   728.011824
DELI                        7.653825e+04   129.287576
EGGS                        8.050300e+04   135.984797
FROZEN FOODS                7.374212e+04   124.564387
GROCERY I                   1.512670e+06  2555.185811
GROCERY II                  1.177300e+04    19.886824
HARDWARE                    1.056000e+03     1.783784
HOME AND KITCHEN I          1.232000e+04    20.810811
HOME AND KITCHEN II         1.447300e+04    24.447635
HOME APPLIANCES             1.840000e+02     0.310811
HOME CARE                   9.997600e+04   168.878378
LADIESWEAR                  8.322000e+03    14.057432
LAWN AND GARDEN             7.272000e+03    12.283784
LINGERIE                    2.977000e+03     5.028716
LIQUOR,WINE,BEER            6.094900e+04   102.954392
MAGAZINES                   4.095000e+03     6.917230
MEATS                       1.798899e+05   303.868076
PERSONAL CARE               8.797100e+04   148.599662
PET SUPPLIES                3.313000e+03     5.596284
PLAYERS AND ELECTRONICS     5.587000e+03     9.437500
POULTRY                     1.771990e+05   299.322590
PREPARED FOODS              4.958602e+04    83.760172
PRODUCE                     1.445806e+06  2442.239757
SCHOOL AND OFFICE SUPPLIES  1.460000e+02     0.246622
SEAFOOD                     1.589800e+04    26.854735

In [81]:
agg_sales.reset_index()

          family  store_nbr           sum       mean
0     AUTOMOTIVE          1   2524.000000   4.263514
1     AUTOMOTIVE          2   3918.000000   6.618243
2     AUTOMOTIVE          3   6790.000000  11.469595
3     AUTOMOTIVE          4   2565.000000   4.332770
4     AUTOMOTIVE          5   3667.000000   6.194257
...          ...        ...           ...        ...
1777     SEAFOOD         50  12773.966999  21.577647
1778     SEAFOOD         51  34250.948976  57.856333
1779     SEAFOOD         52   1219.475999   2.059926
1780     SEAFOOD         53   3745.180001   6.326318
1781     SEAFOOD         54   1082.000000   1.827703

[1782 rows x 4 columns]

### Exercise 3
- Grab store , month 1
- select column storing the mean transaction s
- return to interger index and drop second column index that got created

In [82]:
transactions.head()

        date  store_nbr  transactions  month
0 2013-01-01         25           770      1
1 2013-01-02          1          2111      1
2 2013-01-02          2          2358      1
3 2013-01-02          3          3487      1
4 2013-01-02          4          1922      1

In [103]:
grouped = (
    transactions.groupby(['store_nbr','month'])
    .agg({'transactions':['sum','mean']})
    .sort_values(by=['month',('transactions','sum')],ascending=[True,False])
)

In [105]:
grouped.head()

                transactions
                         sum         mean
store_nbr month
44        1           628438  4246.202703
47        1           568824  3843.405405
45        1           538370  3637.635135
46        1           522763  3532.182432
3         1           463260  3151.428571

In [106]:
grouped.iloc[4,:]

transactions  sum     463260.000000
              mean      3151.428571
Name: (3, 1), dtype: float64

In [107]:
grouped.loc[3,:].iloc[0,:]

transactions  sum     463260.000000
              mean      3151.428571
Name: 1, dtype: float64

In [108]:
grouped.loc[(3,1)]

transactions  sum     463260.000000
              mean      3151.428571
Name: (3, 1), dtype: float64

In [109]:
grouped.iloc[:,1]

store_nbr  month
44         1        4246.202703
47         1        3843.405405
45         1        3637.635135
46         1        3532.182432
3          1        3151.428571
                       ...
32         12        718.058333
21         12       1402.133333
42         12       1279.016667
29         12       1277.116667
22         12        844.166667
Name: (transactions, mean), Length: 641, dtype: float64

In [111]:
grouped.loc[:,('transactions','mean')]

store_nbr  month
44         1        4246.202703
47         1        3843.405405
45         1        3637.635135
46         1        3532.182432
3          1        3151.428571
                       ...
32         12        718.058333
21         12       1402.133333
42         12       1279.016667
29         12       1277.116667
22         12        844.166667
Name: (transactions, mean), Length: 641, dtype: float64

In [102]:
grouped.iloc[:,[1]] # dataframe

                        mean
store_nbr month
44        1      4246.202703
47        1      3843.405405
45        1      3637.635135
46        1      3532.182432
3         1      3151.428571
...                      ...
32        12      718.058333
21        12     1402.133333
42        12     1279.016667
29        12     1277.116667
22        12      844.166667

[641 rows x 1 columns]

In [93]:
grouped = grouped.droplevel(0,axis=1)
grouped.head()

                    sum         mean
store_nbr month
44        1      628438  4246.202703
47        1      568824  3843.405405
45        1      538370  3637.635135
46        1      522763  3532.182432
3         1      463260  3151.428571

In [94]:
grouped.loc[:,'mean']

store_nbr  month
44         1        4246.202703
47         1        3843.405405
45         1        3637.635135
46         1        3532.182432
3          1        3151.428571
                       ...
32         12        718.058333
21         12       1402.133333
42         12       1279.016667
29         12       1277.116667
22         12        844.166667
Name: mean, Length: 641, dtype: float64

In [95]:
grouped.head()

                    sum         mean
store_nbr month
44        1      628438  4246.202703
47        1      568824  3843.405405
45        1      538370  3637.635135
46        1      522763  3532.182432
3         1      463260  3151.428571

In [97]:
grouped.reset_index()

     store_nbr  month     sum         mean
0           44      1  628438  4246.202703
1           47      1  568824  3843.405405
2           45      1  538370  3637.635135
3           46      1  522763  3532.182432
4            3      1  463260  3151.428571
..         ...    ...     ...          ...
636         32     12   86167   718.058333
637         21     12   84128  1402.133333
638         42     12   76741  1279.016667
639         29     12   76627  1277.116667
640         22     12   50650   844.166667

[641 rows x 4 columns]

### agg method 
- diff agg for diff columns

In [112]:
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [114]:
(retail
 .groupby(['family','store_nbr'])
 .agg({'sales':['sum','mean'],
       'onpromotion':['min','max']})
)

                             sales            onpromotion
                               sum       mean         min max
family     store_nbr
AUTOMOTIVE 1           2524.000000   4.263514           0   1
           2           3918.000000   6.618243           0   1
           3           6790.000000  11.469595           0   1
           4           2565.000000   4.332770           0   1
           5           3667.000000   6.194257           0   2
...                            ...        ...         ...  ..
SEAFOOD    50         12773.966999  21.577647           0   7
           51         34250.948976  57.856333           0   7
           52          1219.475999   2.059926           0   5
           53          3745.180001   6.326318           0   5
           54          1082.000000   1.827703           0   2

[1782 rows x 4 columns]

In [117]:
(retail
 .groupby(['family','store_nbr'])
 .agg( sales_sum=('sales','sum'),
      sales_mean=('sales','mean'),
       onpromotion_max=('onpromotion','max'))
)

                         sales_sum  sales_mean  onpromotion_max
family     store_nbr
AUTOMOTIVE 1           2524.000000    4.263514                1
           2           3918.000000    6.618243                1
           3           6790.000000   11.469595                1
           4           2565.000000    4.332770                1
           5           3667.000000    6.194257                2
...                            ...         ...              ...
SEAFOOD    50         12773.966999   21.577647                7
           51         34250.948976   57.856333                7
           52          1219.475999    2.059926                5
           53          3745.180001    6.326318                5
           54          1082.000000    1.827703                2

[1782 rows x 3 columns]

### Exercise 4
- cal the mean of target hit by store, and the sum of bonuses to be paid to each store
- sort them by highest to lowest bonus payout
- same for day of week and month

In [118]:
transactions = transactions.assign(
    target_pct=transactions["transactions"]/2500,
    met_target=(transactions["transactions"]/2500) >= 1,
    bonus_payable=((transactions["transactions"]/2500) >= 1) * 100,
    month=transactions.date.dt.month,
    day_of_week=transactions.date.dt.dayofweek,
)
transactions.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2

In [122]:
## By store
(transactions
 .groupby(['store_nbr'], as_index=False)
 .agg(st_target_mean=('target_pct','mean'),
      st_bonus=('bonus_payable','sum'))
).sort_values('st_bonus', ascending=False).head()

    store_nbr  st_target_mean  st_bonus
46         47        1.558929    167600
43         44        1.734787    167500
44         45        1.479097    167300
2           3        1.280752    167300
45         46        1.428769    165900

In [124]:
## By month
(transactions
 .groupby(['month'], as_index=False)
 .agg(month_target_mean=('target_pct','mean'),
      month_bonus=('bonus_payable','sum'))
).sort_values('month_bonus', ascending=False).head()

    month  month_target_mean  month_bonus
11     12           0.820027       154100
4       5           0.679678       131800
2       3           0.671496       130400
3       4           0.679770       129700
6       7           0.660090       126300

In [125]:
## By weekday
(transactions
 .groupby(['day_of_week'], as_index=False)
 .agg(day_of_week_target_mean=('target_pct','mean'),
      day_of_week_bonus=('bonus_payable','sum'))
).sort_values('day_of_week_bonus', ascending=False).head()

   day_of_week  day_of_week_target_mean  day_of_week_bonus
5            5                 0.781070             266400
6            6                 0.738904             241700
4            4                 0.661596             213000
0            0                 0.654223             191600
2            2                 0.648599             191000

### Transform method 
- agg without reshaping

In [126]:
retail.assign(store_sales = (retail
                             .groupby('store_nbr')['sales']
                             .transform('sum')))

,id,date,store_nbr,family,sales,onpromotion,store_sales
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0,6.230011e+06
1,1945945,2016-01-01,1,BABY CARE,0.000,0,6.230011e+06
2,1945946,2016-01-01,1,BEAUTY,0.000,0,6.230011e+06
3,1945947,2016-01-01,1,BEVERAGES,0.000,0,6.230011e+06
4,1945948,2016-01-01,1,BOOKS,0.000,0,6.230011e+06
...,...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0,1.117290e+07
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1,1.117290e+07
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148,1.117290e+07
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8,1.117290e+07
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0,1.117290e+07

### Exercise 6 store tx vs avg
- cal the mean of tx by store and day of week while keeping the row number 
- comp the perf of the stores txs each day to its day of week average

In [128]:
transactions.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2

In [133]:
transactions.assign(store_avg_tx = (transactions
                             .groupby(['store_nbr','day_of_week'])['transactions']
                             .transform('mean')),
                   trans_vs_avg= lambda x:x['transactions'] - x['store_avg_tx'])

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week,store_avg_tx,trans_vs_avg
0,2013-01-01,25,770,1,0.3080,False,0,1,740.245690,29.754310
1,2013-01-02,1,2111,1,0.8444,False,0,2,1870.782427,240.217573
2,2013-01-02,2,2358,1,0.9432,False,0,2,1952.652720,405.347280
3,2013-01-02,3,3487,1,1.3948,True,100,2,3142.682008,344.317992
4,2013-01-02,4,1922,1,0.7688,False,0,2,1499.569038,422.430962
...,...,...,...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,8,1.1216,True,100,1,2342.410788,461.589212
83484,2017-08-15,51,1573,8,0.6292,False,0,1,1548.448133,24.551867
83485,2017-08-15,52,2255,8,0.9020,False,0,1,1892.588235,362.411765
83486,2017-08-15,53,932,8,0.3728,False,0,1,877.214286,54.785714
83487,2017-08-15,54,802,8,0.3208,False,0,1,817.721992,-15.721992

### pivot tables  # no filter use query and boolean operations
- index
- columns
- -value
- aggfunc
- margin

In [137]:
retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY','BOOKS']").pivot_table(index='family',
                   columns='store_nbr',
                   values='sales',
                   aggfunc='sum',
                  margins=True)

store_nbr,1,2,3,4,5,6,7,8,9,10,...,46,47,48,49,50,51,52,53,54,All
family,,,,,,,,,,,,,,,,,,,,,
AUTOMOTIVE,2524.0,3918.0,6790.0,2565.0,3667.0,3442.0,3031.0,3225.0,7695.0,1772.0,...,8670.0,9537.0,7264.0,7477.0,6702.0,4487.0,1497.0,5811.0,4199.0,226139.0
BABY CARE,0.0,84.0,672.0,24.0,215.0,12.0,48.0,142.0,228.0,179.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,22.0,198.0,7903.0
BEAUTY,1776.0,3824.0,8150.0,3063.0,3604.0,4524.0,2622.0,5942.0,4462.0,933.0,...,8901.0,9766.0,8680.0,6603.0,6353.0,3566.0,972.0,3812.0,405.0,166189.0
BOOKS,211.0,239.0,540.0,266.0,230.0,76.0,211.0,317.0,0.0,0.0,...,199.0,581.0,57.0,454.0,291.0,259.0,0.0,77.0,0.0,6438.0
All,4511.0,8065.0,16152.0,5918.0,7716.0,8054.0,5912.0,9626.0,12385.0,2884.0,...,17770.0,19884.0,16001.0,14534.0,13346.0,8312.0,2469.0,9722.0,4802.0,406669.0

In [141]:
### multiple agg functions
retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY','BOOKS']").pivot_table(index='family',
                   columns='store_nbr',
                   values='sales',
                   aggfunc=('min','max'))

             max                                                         ...  \
store_nbr     1      2     3     4     5     6     7     8     9     10  ...
family                                                                   ...
AUTOMOTIVE  19.0   23.0  32.0  19.0  18.0  24.0  31.0  43.0  44.0  21.0  ...
BABY CARE    0.0    5.0  11.0   3.0   5.0   4.0   2.0   4.0   5.0   9.0  ...
BEAUTY      11.0  108.0  93.0  19.0  25.0  27.0  16.0  30.0  32.0  11.0  ...
BOOKS        8.0    9.0  11.0   9.0   6.0   6.0  10.0  13.0   0.0   0.0  ...

            min
store_nbr    45   46   47   48   49   50   51   52   53   54
family
AUTOMOTIVE  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
BABY CARE   0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
BEAUTY      0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0
BOOKS       0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0  0.0

[4 rows x 108 columns]

In [149]:
retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY','BOOKS']").pivot_table(index='family',
                   columns='store_nbr',
                 #  values='sales',
                   aggfunc=({"sales":['sum','mean'],"onpromotion":"max"}),
                )

           onpromotion                             ...   sales          \
                   max                             ...     sum
store_nbr           1  2  3  4  5  6  7  8  9  10  ...      45      46
family                                             ...
AUTOMOTIVE           1  1  1  1  2  1  2  1  4  1  ...  9809.0  8670.0
BABY CARE            0  0  1  0  1  0  0  0  1  1  ...     0.0     0.0
BEAUTY               2  2  2  2  2  2  2  2  4  4  ...  8068.0  8901.0
BOOKS                0  0  0  0  0  0  0  0  0  0  ...   579.0   199.0



store_nbr       47      48      49      50      51      52      53      54
family
AUTOMOTIVE  9537.0  7264.0  7477.0  6702.0  4487.0  1497.0  5811.0  4199.0
BABY CARE      0.0     0.0     0.0     0.0     0.0     0.0    22.0   198.0
BEAUTY      9766.0  8680.0  6603.0  6353.0  3566.0   972.0  3812.0   405.0
BOOKS        581.0    57.0   454.0   291.0   259.0     0.0    77.0     0.0

[4 rows x 162 columns]

In [144]:
retail.head()

        id        date  store_nbr      family  sales  onpromotion
0  1945944  2016-01-01          1  AUTOMOTIVE    0.0            0
1  1945945  2016-01-01          1   BABY CARE    0.0            0
2  1945946  2016-01-01          1      BEAUTY    0.0            0
3  1945947  2016-01-01          1   BEVERAGES    0.0            0
4  1945948  2016-01-01          1       BOOKS    0.0            0

In [156]:
### heatmaps
retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY']").pivot_table(index='family',
                   columns='store_nbr',
                   values='sales',
                   aggfunc="sum"
                ).style.background_gradient(cmap="RdYlGn", axis=None)

In [157]:
### heatmaps
retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY']").pivot_table(index='family',
                   columns='store_nbr',
                   values='sales',
                   aggfunc="sum"
                ).style.background_gradient(cmap="RdYlGn", axis=1)

In [158]:
### heatmaps
retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY']").pivot_table(index='family',
                   columns='store_nbr',
                   values='sales',
                   aggfunc="sum"
                ).style.background_gradient(cmap="RdYlGn", axis=0)

### melt unpivoting columns into rows wide to long 
-- id_vars, select the columns to melt 
country_revenue.melt(
     id_vars="country",
     value_vars = ["2001","2002","2003"],
     var_name="year",
     value_name="GDP",
     )

In [164]:
pm = retail.query("family in ['AUTOMOTIVE','BABY CARE','BEAUTY']").pivot_table(index='family',
                   columns='store_nbr',
                   values='sales',
                   aggfunc="sum"
                )#.style.background_gradient(cmap="RdYlGn", axis=1)

In [165]:
pm.head()

store_nbr,1,2,3,4,5,6,7,8,9,10,...,45,46,47,48,49,50,51,52,53,54
family,,,,,,,,,,,,,,,,,,,,,
AUTOMOTIVE,2524.0,3918.0,6790.0,2565.0,3667.0,3442.0,3031.0,3225.0,7695.0,1772.0,...,9809.0,8670.0,9537.0,7264.0,7477.0,6702.0,4487.0,1497.0,5811.0,4199.0
BABY CARE,0.0,84.0,672.0,24.0,215.0,12.0,48.0,142.0,228.0,179.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,22.0,198.0
BEAUTY,1776.0,3824.0,8150.0,3063.0,3604.0,4524.0,2622.0,5942.0,4462.0,933.0,...,8068.0,8901.0,9766.0,8680.0,6603.0,6353.0,3566.0,972.0,3812.0,405.0

In [166]:
pm.melt()

     store_nbr   value
0            1  2524.0
1            1     0.0
2            1  1776.0
3            2  3918.0
4            2    84.0
..         ...     ...
157         53    22.0
158         53  3812.0
159         54  4199.0
160         54   198.0
161         54   405.0

[162 rows x 2 columns]

In [176]:
pm.reset_index().melt(
    id_vars="family",
    value_vars=[1,2],
    value_name='tx_sum'
)

       family store_nbr  tx_sum
0  AUTOMOTIVE         1  2524.0
1   BABY CARE         1     0.0
2      BEAUTY         1  1776.0
3  AUTOMOTIVE         2  3918.0
4   BABY CARE         2    84.0
5      BEAUTY         2  3824.0

### Exercise 5 pivot and heat map 
- pivot tx with store nbr as index , columns day of week, with the sum of bonus payable as cells
- filter to stores that had a non zero bonus payable and create a heatmap
- then melt one row for each store and day of the week with corresponding total owed

In [177]:
transactions.head()

,date,store_nbr,transactions,month,target_pct,met_target,bonus_payable,day_of_week
0,2013-01-01,25,770,1,0.3080,False,0,1
1,2013-01-02,1,2111,1,0.8444,False,0,2
2,2013-01-02,2,2358,1,0.9432,False,0,2
3,2013-01-02,3,3487,1,1.3948,True,100,2
4,2013-01-02,4,1922,1,0.7688,False,0,2

In [185]:
store_range = transactions["store_nbr"].unique()[1:12]
transactions.query("bonus_payable > 0 & store_nbr in @store_range" ).pivot_table(index='store_nbr',
                                                    columns='day_of_week',
                                                    values = 'bonus_payable',
                                                    aggfunc='sum'
    
).style.background_gradient(cmap="RdYlGn", axis=1)

In [186]:
# melt
pm = transactions.query("bonus_payable > 0 & store_nbr in @store_range" ).pivot_table(index='store_nbr',
                                                    columns='day_of_week',
                                                    values = 'bonus_payable',
                                                    aggfunc='sum'
    
)

In [187]:
pm.head()

day_of_week        0        1        2        3        4        5        6
store_nbr
1              200.0    300.0    300.0    200.0    100.0      NaN      NaN
2              300.0    600.0    500.0    400.0    400.0    500.0    200.0
3            24000.0  23900.0  23900.0  23900.0  23900.0  24000.0  23700.0
4              200.0    300.0    300.0    200.0    100.0    200.0      NaN
5              200.0    300.0    300.0    100.0    100.0    100.0      NaN

In [188]:
pm.reset_index().melt(
    id_vars=['store_nbr','day_of_week'],
    value_name = 'bonus_payable'
)
pm.reset_index().melt(
    id_vars="family",
    value_vars=[1,2],
    value_name='tx_sum'
)

day_of_week,store_nbr,0,1,2,3,4,5,6
0,1,200.0,300.0,300.0,200.0,100.0,NaN,NaN
1,2,300.0,600.0,500.0,400.0,400.0,500.0,200.0
2,3,24000.0,23900.0,23900.0,23900.0,23900.0,24000.0,23700.0
3,4,200.0,300.0,300.0,200.0,100.0,200.0,NaN
4,5,200.0,300.0,300.0,100.0,100.0,100.0,NaN
5,6,400.0,500.0,500.0,300.0,200.0,900.0,300.0
6,7,200.0,300.0,300.0,200.0,100.0,100.0,NaN
7,8,22000.0,18800.0,23800.0,18000.0,22900.0,23400.0,20000.0
8,9,1200.0,800.0,800.0,700.0,400.0,7900.0,5100.0
9,11,3500.0,4800.0,3200.0,3000.0,2000.0,15600.0,17600.0